In [1]:
import numpy as np 
import pandas as pd

In [2]:
first_serie = pd.Series([1.5,4.,5.,6.])

In [3]:
first_serie

0    1.5
1    4.0
2    5.0
3    6.0
dtype: float64

In [7]:
first_serie.values

array([1.5, 4. , 5. , 6. ])

In [8]:
first_serie.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
first_serie[0:3]

0    1.5
1    4.0
2    5.0
dtype: float64

In [12]:
second_serie = pd.Series(np.arange(5), index=['uno','dos','tres','cuatro', 'cinco'])

In [13]:
second_serie

uno       0
dos       1
tres      2
cuatro    3
cinco     4
dtype: int64

In [21]:
second_serie['uno':'cuatro']

uno       0
dos       1
tres      2
cuatro    3
dtype: int64

In [22]:
third_serie = pd.Series({'uno': 1, 'dos': 2, 'tres': 3})

In [24]:
fourth_series = pd.Series(4, index=[np.arange(11)])

In [25]:
fourth_series

0     4
1     4
2     4
3     4
4     4
5     4
6     4
7     4
8     4
9     4
10    4
dtype: int64

In [26]:
lista_ventas = [15000, 18000, 22000, 19500, 21000, 23000, 24000, 20000, 18500, 17000, 16000, 17500]
lista_meses = ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"]
ventas_mensuales = pd.Series(lista_ventas, index=lista_meses)
ventas_mensuales

Enero         15000
Febrero       18000
Marzo         22000
Abril         19500
Mayo          21000
Junio         23000
Julio         24000
Agosto        20000
Septiembre    18500
Octubre       17000
Noviembre     16000
Diciembre     17500
dtype: int64

In [27]:
print(ventas_mensuales.sum())

231500

In [28]:
print(ventas_mensuales.max())

24000

In [29]:
print(ventas_mensuales[ventas_mensuales == ventas_mensuales.max()])

Julio    24000
dtype: int64

In [30]:
print(ventas_mensuales.mean())

19291.666666666668

In [32]:
print(ventas_mensuales[ventas_mensuales > ventas_mensuales.mean()].index)

Index(['Marzo', 'Abril', 'Mayo', 'Junio', 'Julio', 'Agosto'], dtype='object')

In [37]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)

In [38]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [39]:
print(states.index)
print(states.columns)

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')
Index(['population', 'area'], dtype='object')

In [40]:
states.values

array([[38332521,   423967],
       [26448193,   695662],
       [19651127,   141297],
       [19552860,   170312],
       [12882135,   149995]])

In [42]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [45]:
meses = ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"]
ventas_mensuales_A = pd.Series([15000, 18000, 22000, 19500, 21000, 23000, 24000, 20000, 18500, 17000, 16000, 17500]) # index = lista_meses
ventas_mensuales_B = pd.Series([19000, 18700, 14000, 21500, 21500, 15000, 16000, 21000, 19500, 14000, 13000, 14500])
ventas_mensuales_C = pd.Series([0, 0, 0, 14500, 17500, 19000, 24000, 26000, 22500, 17000, 23000, 23500])

ventas_global = {'Meses': meses,
                 'Ventas_A': ventas_mensuales_A,
                 'Ventas_B': ventas_mensuales_B,
                 'Ventas_C': ventas_mensuales_C}

In [70]:
df_ventas = pd.DataFrame(ventas_global).set_index('Meses')
df_ventas

            Ventas_A  Ventas_B  Ventas_C
Meses
Enero          15000     19000         0
Febrero        18000     18700         0
Marzo          22000     14000         0
Abril          19500     21500     14500
Mayo           21000     21500     17500
Junio          23000     15000     19000
Julio          24000     16000     24000
Agosto         20000     21000     26000
Septiembre     18500     19500     22500
Octubre        17000     14000     17000
Noviembre      16000     13000     23000
Diciembre      17500     14500     23500

In [73]:
df_ventas.mean()

Ventas_A    19291.666667
Ventas_B    17308.333333
Ventas_C    15583.333333
dtype: float64

In [88]:
# Cual es la tienda que mas ventas ha tenido en un mes
print(df_ventas.max().idxmax())
# Cual es la tienda que mayor promedio de ventas tiene
print(df_ventas.mean().idxmax())
# Calcula una nueva columna con el total de ventas de todas las tiendas
df_ventas['total_ventas'] = df_ventas['Ventas_A'] + df_ventas['Ventas_B'] + df_ventas['Ventas_C']
print(df_ventas['total_ventas'])
# Cual ha sido el mes con mas ventas
df_ventas['total_ventas'].idxmax()

total_ventas
total_ventas
Meses
Enero         34000
Febrero       36700
Marzo         36000
Abril         55500
Mayo          60000
Junio         57000
Julio         64000
Agosto        67000
Septiembre    60500
Octubre       48000
Noviembre     52000
Diciembre     55500
Name: total_ventas, dtype: int64

'Agosto'

In [92]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
# cities = pd.Series({'California': "Sacramento", 'Texas': "Otra ciudad 1",
#                  'New York': "Albany", 'Florida': "Miami",
#                  'Illinois': "Otra ciudad 2"})
data = pd.DataFrame({'area':area, 'pop':pop})
data.reset_index()

        index    area       pop
0  California  423967  38332521
1       Texas  695662  26448193
2    New York  141297  19651127
3     Florida  170312  19552860
4    Illinois  149995  12882135

In [96]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [101]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [102]:
df = pd.DataFrame({'department': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'VV': range(6)})
df

  department  VV
0          A   0
1          B   1
2          C   2
3          A   3
4          B   4
5          C   5

In [104]:
df.groupby('department').mean()

             VV
department
A           1.5
B           2.5
C           3.5

In [105]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [106]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [107]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [108]:
temp = planets.groupby('method')['year'].describe()
temp

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [118]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'department': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'anio': [2020,2020,2020,2021,2021,2021],
                   'VV': rng.randint(0, 10, 6)},
                   columns = ['department', 'anio', 'VV'])
df

  department  anio  VV
0          A  2020   5
1          B  2020   0
2          C  2020   3
3          A  2021   3
4          B  2021   7
5          C  2021   9

In [119]:
df.groupby('department').median()

              anio   VV
department
A           2020.5  4.0
B           2020.5  3.5
C           2020.5  6.0

In [120]:
df.groupby('department').aggregate(['min','max','mean'])

            anio                VV
             min   max    mean min max mean
department
A           2020  2021  2020.5   3   5  4.0
B           2020  2021  2020.5   0   7  3.5
C           2020  2021  2020.5   3   9  6.0

In [126]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [127]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
print(ser1)
ser2 = pd.Series(['D', 'E', 'F'], index=[1, 2, 3])
print(ser2)
pd.concat([ser1, ser2], axis = 0).reset_index(drop=True)

1    A
2    B
3    C
dtype: object
1    D
2    E
3    F
dtype: object

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object